Autodesk.Navisworks.Api.ApplicationParts.ApplicationPlugins
Provides information about the Plugins available in the application runtime

Autodesk.Navisworks.Api.ApplicationParts.ApplicationPlugins.AddPluginAssembly(System.String)
Adds another assembly that plugins can be loaded from.
Assembly is loaded using the LoadFrom context and can be used outside the Application root.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationPlugins.ExecuteAddInPlugin(System.String,System.String[])
Executes an Addin Plugin whose full name is given by pluginId, passing in the paramaters given.
pluginId:  The full identifier for the plugin.
This is formed as Name.DeveloperId
parameters: Optional parameters to pass to the plugin
Throws System.InvalidOperationException:
Plugin not found or is not an AddInPlugin
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException:
Failed to load plugin
Throws Autodesk.Navisworks.Api.Plugins.ExecuteDisabledException:
Execute is Disabled via CanExecute

Autodesk.Navisworks.Api.ApplicationParts.ApplicationPlugins.FindInterfaces(System.String)
Returns a collection of PluginRecords that implement a particular interface
interfaceId:
The Id of the InterfaceRecord
Returns:
Collection if empty if no mathcing PluginRecordsare found

Autodesk.Navisworks.Api.ApplicationParts.ApplicationPlugins.FindPlugin(System.String)
Searches for a PluginRecord by Id
pluginId:  The full identifier for the plugin.
This is formed as Name.DeveloperId
Returns:
Returns the PluginRecord or Null if it cannot be found

Autodesk.Navisworks.Api.ApplicationParts.ApplicationPlugins.PluginRecords
Gets collection of PluginRecords that describe the available plugins

Autodesk.Navisworks.Api.ApplicationParts.ApplicationPlugins.PluginRecordsChanged
Occurs when the collection of PluginRecords has changed.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationPlugins.PluginRecordsChanging
Occurs when the collection of PluginRecords is about to change.